Repository: eleonora2003/SafeSteps
Catalog: lib/l10n/app_*.arb
Languages: sl

source: Legend
sl: Legenda

# safe
source: Safe (7–10)
sl: Varno (7–10)

# medium
source: Medium (4–6)
sl: Srednje (4–6)

# danger
source: Dangerous (1–3)
sl: Nevarno (1–3)

# searchHint
source: Enter address or street
sl: Vnesite naslov ali ulico

# thankYou
source: Thank you for your rating!
sl: Hvala za vašo oceno!

# chartTitle
source: Ratings Chart
sl: Graf ocen

# noRatings
source: No rated locations.
sl: Ni ocenjenih lokacij.

# chartSubtitle
source: Proportion of safety ratings
sl: Razmerje varnostnih ocen

# safeChart
source: Safe
sl: Varne

# mediumChart
source: Medium
sl: Srednje

# dangerChart
source: Dangerous
sl: Nevarne

# allRatingsTitle
source: All Rated Locations
sl: Vse ocene

source: Only mine
sl: Samo moje

# ratingLabel
source: Rating
sl: Ocena

# coordinatesLabel
source: Coordinates
sl: Koordinate

# commentLabel
source: Comment
sl: Komentar

# dateLabel
source: Date
sl: Datum

# loginSubtitle
source: Your green guide to safe movement at night.
sl: Vaš zeleni vodič za varno gibanje ponoči.

# loginButton
source: Sign in with Google account
sl: Prijava z Google računom

# loginInfo
source: Your data is safe. We use Google for identity verification.
sl: Vaši podatki so varni. Uporabljamo Google za preverjanje identitete.

# filterAll
source: All locations
sl: Vse lokacije

# filterSafe
source: Safe locations
sl: Varne lokacije

# filterDangerous
source: Dangerous locations
sl: Nevarne lokacije

# rateLocation
source: Rate the location
sl: Ocenite lokacijo

# ratingLabelSlider
source: Safety rating (1–10):
sl: Varnostna ocena (1–10):

source: Comment (optional)
sl: Komentar (neobvezno)

source: Save
sl: Shrani

# enterStartLocation
source: Enter start location (e.g., Ljubljana)
sl: Vnesi začetno lokacijo (npr. Ljubljana)

# enterEndLocation
source: Enter end location (e.g., Maribor)
sl: Vnesi končno lokacijo (npr. Maribor)

source: Safety Settings
sl: Varnostne nastavitve

source: Consider Lighting
sl: Upoštevaj osvetlitev

source: Consider Traffic
sl: Upoštevaj promet

source: Consider User Ratings
sl: Upoštevaj ocene uporabnikov

source: Travel Mode
sl: Način potovanja

source: By car 🚗
sl: Vozilo 🚗

# byWalk
source: By foot 🚶
sl: Hoja 🚶

source: Cancel
sl: Prekliči

# legendTitle
source: Safety Scale
sl: Varnostna lestvica

# legendSafe
source: 7-10: Safe route
sl: 7-10: Varna pot

# legendMedium
source: 4-6: Moderately safe
sl: 4-6: Zmerno varna

# legendDanger
source: 1-3: Dangerous
sl: 1-3: Nevarna

source: Active criteria:
sl: Aktivni kriteriji:

# criterionTraffic
source: Traffic 🚦
sl: Promet 🚦

# criterionLighting
source: Lighting 💡
sl: Osvetlitev 💡

# criterionUserRatings
source: User ratings ⭐
sl: Ocene uporabnikov⭐

# travelModeLabel
source: Travel mode
sl: Način poti

source: Tap to close
sl: Tapni za zapiranje

source: Choose action
sl: Izberite akcijo

source: Add marker
sl: Dodaj marker

source: Rate street
sl: Oceni ulico

# streetNotFound
source: Cannot find street at this location
sl: Ne najdem ulice na tej lokaciji

source: Rate street safety
sl: Ocenite varnost ulice

# selectRatingWithSlider
source: Select a rating using the slider
sl: Izberite oceno s pomočjo drsnika

source: Save rating
sl: Shrani oceno

source: Error
sl: Napaka

# commentHint
source: Enter a comment about street safety
sl: Vnesite komentar o varnosti ulice

# ratingSaved
source: Rating saved successfully
sl: Ocena uspešno shranjena
